       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID.     HELLOWORLD.
DATE-WRITTEN.   02/05/96        21:04.
       AUTHOR    BRIAN COLLINS
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. RM-COBOL.
OBJECT-COMPUTER. RM-COBOL.

DATA DIVISION.
FILE SECTION.

PROCEDURE DIVISION.

MAIN-LOGIC SECTION.
BEGIN.
    DISPLAY " " LINE 1 POSITION 1 ERASE EOS.
    DISPLAY "HELLO, WORLD." LINE 15 POSITION 10.
    STOP RUN.
MAIN-LOGIC-EXIT.
    EXIT.
